tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"

brew "git"
brew "tree"
brew "wget"
brew "zsh"
brew "postgresql"

# emacs vterm-modeのビルドで必要
brew "cmake"
brew "libtool"

# 色付きdiffコマンド diffのエイリアスにしている
brew "colordiff"

# 何かを色付するために必要
brew "coreutils"

# ファイル検索
brew "fzf"
brew "ag"

# これがないと生きていけない
brew "ghq"

# JSONを綺麗に出力してくれる
brew "jq"

# ghqと組み合わせて使っている
brew "peco"

# 言語のバージョン管理のバージョン管理
brew "anyenv"

# zshのプラグイン管理
brew "zplug"

# rmの代替コマンドrmせずにゴミ箱に送る
brew "trash"


cask "alfred"
cask "docker"
cask "emacs"
cask "figma"
cask "font-fira-code"
cask "google-chrome"
cask "gyazo"
cask "kindle"
cask "deepl"
cask "zoom"
cask "amazon-music"
# cask "biscuit"
# cask "coteditor"
# cask "transmit"
# cask "google-cloud-sdk"
# cask "google-japanese-ime"
# cask "font-noto-sans-cjk-jp"