tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"

# emacs vterm-modeのビルドで必要
brew "cmake"
brew "libtool"

# 色付きdiffコマンド diffのエイリアスにしている
brew "colordiff"

# 何かを色付するために必要
brew "coreutils"

# ファイル検索
brew "fzf"

# これがないと生きていけない
brew "ghq"

# JSONを綺麗に出力してくれる
brew "jq"

# ghqと組み合わせて使っている
brew "peco"

# 言語のバージョン管理のバージョン管理
brew "anyenv"

# zshのプラグイン管理
brew "zplug"

# rmの代替コマンドrmせずにゴミ箱に送る
brew "trash"

# 言わずもがな
brew "git"
brew "tree"
brew "wget"
brew "zsh"


cask "1password"
cask "alfred"
cask "biscuit"
cask "coteditor"
cask "docker"
cask "emacs"
cask "figma"
cask "font-fira-code"
cask "font-noto-sans-cjk-jp"
cask "google-chrome"
cask "google-cloud-sdk"
cask "google-japanese-ime"
cask "gyazo"
cask "iterm2"
cask "kindle"
cask "transmit"
